#### Hands-on Lab: Built-in functions - Aggregate, Scalar, String, Date and Time Functions

    ID	ANIMAL	QUANTITY	COST	RESCUEDATE
    1	Cat	9	450.09	5/29/2018
    2	Dog	3	666.66	6/1/2018
    3	Dog	1	100	6/4/2018
    4	Parrot	2	50	6/4/2018
    5	Dog	1	75.75	6/10/2018
    6	Hamster	6	60.6	6/11/2018
    7	Cat	1	44.44	6/11/2018
    8	Goldfish	24	48.48	6/14/2018
    9	Dog	2	222.22	6/15/2018

#### After completing this lab, you will be able to:

Compose and run sub-queries with multiple tables
Check query results and view log files

#### ### Exercise 2: Aggregate Functions
Query A1: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

In [2]:
%load_ext sql
%sql sqlite:///PETRESCUE-CREATE.db

In [4]:
%%sql

create table PETRESCUE (
ID INTEGER NOT NULL,
ANIMAL VARCHAR(20),
QUANTITY INTEGER,
COST DECIMAL(6,2),
RESCUEDATE DATE,
PRIMARY KEY (ID)
);

insert into PETRESCUE values 
(1,'Cat',9,450.09,'2018-05-29'),
(2,'Dog',3,666.66,'2018-06-01'),
(3,'Dog',1,100.00,'2018-06-04'),
(4,'Parrot',2,50.00,'2018-06-04'),
(5,'Dog',1,75.75,'2018-06-10'),
(6,'Hamster',6,60.60,'2018-06-11'),
(7,'Cat',1,44.44,'2018-06-11'),
(8,'Goldfish',24,48.48,'2018-06-14'),
(9,'Dog',2,222.22,'2018-06-15')

;

 * sqlite:///PETRESCUE-CREATE.db
Done.
9 rows affected.

[]

In [5]:
%%sql

select * from PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29'),
 (2, 'Dog', 3, 666.66, '2018-06-01'),
 (3, 'Dog', 1, 100, '2018-06-04'),
 (4, 'Parrot', 2, 50, '2018-06-04'),
 (5, 'Dog', 1, 75.75, '2018-06-10'),
 (6, 'Hamster', 6, 60.6, '2018-06-11'),
 (7, 'Cat', 1, 44.44, '2018-06-11'),
 (8, 'Goldfish', 24, 48.48, '2018-06-14'),
 (9, 'Dog', 2, 222.22, '2018-06-15')]

In [6]:
%%sql

SELECT SUM(COST) FROM PETRESCUE

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(1718.24,)]

#### Query A2: Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called SUM_OF_COST.

In [8]:
%%sql

SELECT SUM(COST) as SUM_OF_COST FROM PETRESCUE

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(1718.24,)]

#### Query A3: Enter a function that displays the maximum quantity of animals rescued.

In [10]:
%%sql

SELECT MAX(QUANTITY) FROM PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(24,)]

#### Query A4: Enter a function that displays the average cost of animals rescued.

In [11]:
%%sql

SELECT AVG(COST) FROM PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(190.91555555555556,)]

#### Query A5: Enter a function that displays the average cost of rescuing a dog.

In [12]:
%%sql

SELECT AVG(COST) FROM PETRESCUE WHERE ANIMAL = "Dog";

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(266.15749999999997,)]

In [15]:
%%sql
select AVG(COST/QUANTITY) from PETRESCUE where ANIMAL = 'Dog';

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(127.27000000000001,)]

### Exercise 3: Scalar and String Functions
#### Query B1: Enter a function that displays the rounded cost of each rescue.

In [14]:
%%sql

SELECT ROUND(COST) FROM PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(450.0,),
 (667.0,),
 (100.0,),
 (50.0,),
 (76.0,),
 (61.0,),
 (44.0,),
 (48.0,),
 (222.0,)]

#### Query B2: Enter a function that displays the length of each animal name.

In [17]:
%%sql

SELECT LENGTH(COST) FROM PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(6,), (6,), (3,), (2,), (5,), (4,), (5,), (5,), (6,)]

#### Query B3: Enter a function that displays the animal name in each rescue in uppercase.

In [ ]:
-- select UCASE(ANIMAL) from PETRESCUE

In [31]:
%%sql
select UPPER(ANIMAL) from PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[('CAT',),
 ('DOG',),
 ('DOG',),
 ('PARROT',),
 ('DOG',),
 ('HAMSTER',),
 ('CAT',),
 ('GOLDFISH',),
 ('DOG',)]

#### Query B4: Enter a function that displays the animal name in each rescue in uppercase without duplications.

In [30]:
%%sql
select DISTINCT UPPER(ANIMAL) from PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[('CAT',), ('DOG',), ('PARROT',), ('HAMSTER',), ('GOLDFISH',)]

#### Query B5: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use cat in lower case in the query.

In [33]:
%%sql
select LOWER(ANIMAL), QUANTITY, COST, RESCUEDATE from PETRESCUE
Where ANIMAL = "Cat"

 * sqlite:///PETRESCUE-CREATE.db
Done.

[('cat', 9, 450.09, '2018-05-29'), ('cat', 1, 44.44, '2018-06-11')]

In [34]:
%%sql
select * from PETRESCUE where LCASE(ANIMAL) = 'cat';

 * sqlite:///PETRESCUE-CREATE.db
(sqlite3.OperationalError) no such function: LCASE
[SQL: select * from PETRESCUE where LCASE(ANIMAL) = 'cat';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [35]:
%%sql
select * from PETRESCUE
Where LOWER(ANIMAL) = "cat"

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29'), (7, 'Cat', 1, 44.44, '2018-06-11')]

### Exercise 4: Date and Time Functions
Query C1: Enter a function that displays the day of the month when cats have been rescued.

In [37]:
%%sql

SELECT DAY(RESCUEDATE)
from PETRESCUE
Where ANIMAL = "Cat"

 * sqlite:///PETRESCUE-CREATE.db
(sqlite3.OperationalError) no such function: DAY
[SQL: SELECT DAY(RESCUEDATE)
from PETRESCUE
Where ANIMAL = "Cat"]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [38]:
%%sql

SELECT strftime('%d', RESCUEDATE)
FROM PETRESCUE
WHERE ANIMAL = 'Cat';

 * sqlite:///PETRESCUE-CREATE.db
Done.

[('29',), ('11',)]

In [39]:
%%sql

SELECT strftime('%m', RESCUEDATE)
FROM PETRESCUE
WHERE ANIMAL = 'Cat';

 * sqlite:///PETRESCUE-CREATE.db
Done.

[('05',), ('06',)]

#### Query C2: Enter a function that displays the number of rescues on the 5th month.

In [41]:
%%sql
select SUM(QUANTITY) from PETRESCUE 
where MONTH(RESCUEDATE)='05';

 * sqlite:///PETRESCUE-CREATE.db
(sqlite3.OperationalError) no such function: MONTH
[SQL: select SUM(QUANTITY) from PETRESCUE
where MONTH(RESCUEDATE)='05';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [42]:
%%sql

SELECT SUM(QUANTITY) 
FROM PETRESCUE 
WHERE strftime('%m', RESCUEDATE) = '05';

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(9,)]

#### Query C3: Enter a function that displays the number of rescues on the 14th day of the month.

In [4]:
%%sql

SELECT SUM(QUANTITY) 
FROM PETRESCUE 
WHERE strftime('%d', RESCUEDATE) = '14';

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(24,)]

#### Query C4: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

In [5]:
%%sql
select (RESCUEDATE + 3 DAYS) from PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
(sqlite3.OperationalError) near "DAYS": syntax error
[SQL: select (RESCUEDATE + 3 DAYS) from PETRESCUE;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#### SQLite does not support adding days directly to a date using the syntax RESCUEDATE + 3 DAYS.

In [7]:
%%sql

SELECT date(RESCUEDATE, '+3 days') 
FROM PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[('2018-06-01',),
 ('2018-06-04',),
 ('2018-06-07',),
 ('2018-06-07',),
 ('2018-06-13',),
 ('2018-06-14',),
 ('2018-06-14',),
 ('2018-06-17',),
 ('2018-06-18',)]

#### Query C5: Enter a function that displays the length of time the animals have been rescued; the difference between todays date and the rescue date.

#### SQLite does not support direct date subtraction like (CURRENT DATE - RESCUEDATE). However, you can use the julianday() function to calculate the difference between two dates. Hereâ€™s the corrected query:

In [6]:
%%sql
select (CURRENT DATE - RESCUEDATE) from PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
(sqlite3.OperationalError) near "DATE": syntax error
[SQL: select (CURRENT DATE - RESCUEDATE) from PETRESCUE;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%%sql

SELECT julianday('now') - julianday(RESCUEDATE) AS days_difference
FROM PETRESCUE;

 * sqlite:///PETRESCUE-CREATE.db
Done.

[(2288.2054467475973,),
 (2285.2054467475973,),
 (2282.2054467475973,),
 (2282.2054467475973,),
 (2276.2054467475973,),
 (2275.2054467475973,),
 (2275.2054467475973,),
 (2272.2054467475973,),
 (2271.2054467475973,)]

#### Lab Solutions
Exercise 2 Solutions: Aggregate Functions
Query A1: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

select SUM(COST) from PETRESCUE;

Query A2: Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called SUM_OF_COST.

select SUM(COST) AS SUM_OF_COST from PETRESCUE;

Query A3: Enter a function that displays the maximum quantity of animals rescued.

select MAX(QUANTITY) from PETRESCUE;

Query A4: Enter a function that displays the average cost of animals rescued.

select AVG(COST) from PETRESCUE;

Query A5: Enter a function that displays the average cost of rescuing a dog.

Hint - Bear the cost of rescuing one dog on one day, which is different from another day. So you will have to use an average of averages.

select AVG(COST/QUANTITY) from PETRESCUE where ANIMAL = 'Dog';

Exercise 3 Solutions: Scalar and String Functions
Query B1: Enter a function that displays the rounded cost of each rescue.

select ROUND(COST) from PETRESCUE;

Query B2: Enter a function that displays the length of each animal name.

select LENGTH(ANIMAL) from PETRESCUE;

Query B3: Enter a function that displays the animal name in each rescue in uppercase.

select UCASE(ANIMAL) from PETRESCUE;

Query B4: Enter a function that displays the animal name in each rescue in uppercase without duplications.

`select DISTINCT(UCASE(ANIMAL)) from PETRESCUE;

Query B5: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use cat in lower case in the query.

select * from PETRESCUE where LCASE(ANIMAL) = 'cat';

Exercise 4 Solutions: Date and Time Functions
Query C1: Enter a function that displays the day of the month when cats have been rescued.

select DAY(RESCUEDATE) from PETRESCUE where ANIMAL = 'Cat';

Query C2: Enter a function that displays the number of rescues on the 5th month.

select SUM(QUANTITY) from PETRESCUE where MONTH(RESCUEDATE)='05';

Query C3: Enter a function that displays the number of rescues on the 14th day of the month.

select SUM(QUANTITY) from PETRESCUE where DAY(RESCUEDATE)='14';

Query C4: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

select (RESCUEDATE + 3 DAYS) from PETRESCUE;

Query C5: Enter a function that displays the length of time the animals have been rescued; the difference between todays date and the rescue date.

select (CURRENT DATE - RESCUEDATE) from PETRESCUE;